Catalogs/ВидыОплатЧекаККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ВидыОплатЧекаККМ</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьВидДенежныхСредств</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОплатЧекаККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкКредитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорВзаиморасчетовБанкаКредитора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентБанковскойКомиссии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыОплатЧекаККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипыОплатЧекаККМ</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскийКредит</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВидыОплатЧекаККМ/Ext/ObjectModule.bsl
// Обработчик события "ПередЗаписью" объекта.
//
Процедура ПередЗаписью(Отказ)

	Если Не (ЭтоГруппа Или ОбменДанными.Загрузка) Тогда
		Если НЕ ЗначениеЗаполнено(ТипОплаты) Тогда
			СтрокаСообщения = НСтр("ru='Не заполнено значение реквизита ""Тип оплаты""!';uk='Не заповненно значення реквізита ""Тип оплати""!'");
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаСообщения, Отказ, НСтр("ru='Справочник: Виды оплат чека ККМ';uk='Довідник: Види оплат чека ККМ'"));
		КонецЕсли;

		Если ТипОплаты = Перечисления.ТипыОплатЧекаККМ.БанковскийКредит Тогда
			Если НЕ ЗначениеЗаполнено(БанкКредитор) Тогда
				СтрокаСообщения = НСтр("ru='Не заполнено значение реквизита ""Банк-кредитор""!';uk='Не заповнено значення реквізиту ""Банк-кредитор""!'");
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаСообщения, Отказ, НСтр("ru='Справочник: Виды оплат чека ККМ';uk='Довідник: Види оплат чека ККМ'"));
			КонецЕсли;

			Если НЕ ЗначениеЗаполнено(ДоговорВзаиморасчетовБанкаКредитора) Тогда
				СтрокаСообщения = НСтр("ru='Не заполнено значение реквизита ""Договор взаиморасчетов""!';uk='Не заповнено значення реквізиту ""Договір взаєморозрахунків""!'");
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаСообщения, Отказ, НСтр("ru='Справочник: Виды оплат чека ККМ';uk='Довідник: Види оплат чека ККМ'"));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ПередЗаписью()
